Tekla.Structures.ModelInternal.GridSurfaceExtensions
Contains extension methods that are intended for internal use

Tekla.Structures.ModelInternal.GridSurfaceExtensions.SetIsManual(Tekla.Structures.Model.GridSurface,System.Boolean)
Sets the flag that indicates whether the grid surface is manual
surface: Surface to set the value to
value: Value to be set